IDEA Open Model
LineSupport.GeometryPointsPath Property
Compatible with IDEA StatiCa v 10.1
 list of line load points
 Namespace: IdeaRS.OpenModel.Detail
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 10.1.0.1 (10.1.0.1)
Syntax
public Polygon2D GeometryPointsPath { get; set; }
Public Property GeometryPointsPath As Polygon2D
	Get
	Set
public:
property Polygon2D^ GeometryPointsPath {
	Polygon2D^ get ();
	void set (Polygon2D^ value);
}
Property Value
Type: Polygon2D
See Also
Reference
LineSupport Class
IdeaRS.OpenModel.Detail Namespace